<template>
  <section class="page-main__faq faq grid">
    <div class="heading-group heading-group--h1">
      <div class="heading-group__wrap">
        <h1 class="heading heading--h1">{{ pageTitle }}
          <span class="heading__promo"></span>
        </h1>
        <span class="heading-group__label">Отвечаем на ваши вопросы</span>
      </div>
    </div>
    <div class="grid__col-12 grid">
      <div class="grid__col-3">
        <div class="faq__nav">
          <ul class="faq__nav-list">
            <li class="faq__nav-item"
                v-for="item in nav"
                :key="item.slug">
              <nuxt-link :to="`/knowledge#faq-${item.slug}`"
                         class="link-ancor faq__ancor">
                {{ item.title }}
              </nuxt-link>
            </li>
          </ul>
        </div>
      </div>
      <div class="grid__col-9">
        <section class="faq__questions col">
          <div class="faq__questions-block">
            <div class="faq__questions-group"
                 v-for="item in body"
                 :key="item.slug"
                 :id="`faq-${item.slug}`">
              <h2 class="faq__heading heading heading--h2">{{ item.title }}</h2>
              <div class="faq__item"
                   :class="{'faq__item--active':question.active}"
                   v-for="question in item.list"
                   @click="question.active = !question.active"
                   :key="question.question">
                <dt class="faq__question">{{ question.question }}</dt>
                <VueSlideToggle :open="question.active"
                                :duration="500">
                  <dd class="faq__answer">{{ question.answer }}</dd>
                </VueSlideToggle>
                <svg-icon class="faq__close"
                          name="icon-close-s"/>
              </div>

            </div>
          </div>
        </section>
      </div>
    </div>
  </section>
</template>

<script>
import jsonld from "@/mixins/jsonld";

export default {
  mixins: [jsonld],
  data() {
    return {
      jsonType: 'faq',
      nav: [
        {
          title: 'Общие вопросы',
          slug: 'general'
        },
        {
          title: 'Автокредитование',
          slug: 'credit'
        },
        {
          title: 'Госпрограммы',
          slug: 'programms'
        },
        {
          title: 'Акции',
          slug: 'promo'
        },
        {
          title: 'Обмен авто',
          slug: 'exchange'
        },
        {
          title: 'Выкуп',
          slug: 'buyout'
        },
        {
          title: 'Тест-драйв',
          slug: 'test'
        },
      ],
      body: [
        {
          slug: 'general',
          title: 'Общие вопросы',
          list: [
            {
              question: 'Что такое CARRO?',
              answer: 'CARRO - первый в России автопортал проверенных автомобилей.',
              active: false
            },
            {
              question: 'Какие автосалоны представлены на CARRO?',
              answer: 'На CARRO представлены крупнейшие автосалоны Москвы, специализирующиеся на реализации автомобилей с пробегом.',
              active: false
            },
            {
              question: 'Каким образом осуществляется проверка автомобилей, представленных на сайте CARRO?',
              answer: 'Проверка осуществляется специалистами CARRO, которые выезжают в автосалоны-партнеры и производят как юридическую проверку, так и диагностику технической составляющей автомобиля.',
              active: false
            },
            {
              question: 'Могу ли я получить дополнительную скидку при покупке автомобиля через CARRO?',
              answer: 'При покупке автомобиля через CARRO в кредит Вы получаете скидку до 50 000 ₽ на любую понравившуюся модель.',
              active: false
            },
            {
              question: 'Могу ли я приобрести автомобиль за наличные?',
              answer: 'Конечно, Вы можете купить понравившееся авто как за наличные деньги с единовременной выплатой, так и в кредит.',
              active: false
            },
            {
              question: 'Какие гарантии я получаю на приобретаемый автомобиль через CARRO',
              answer: 'Вы получаете гарантию юридической чистоты сделки и технической составляющей выбранного авто.',
              active: false
            },
            {
              question: 'Могу ли я купить подержанный автомобиль в кредит?',
              answer: 'Да, покупка подержанного автомобиля возможна в кредит.',
              active: false
            },
            {
              question: 'Могу ли я вернуть приобретенный автомобиль?',
              answer: 'Вы можете вернуть приобретенный Вами автомобиль через CARRO в случае его технической неисправности в течение одного года',
              active: false
            },
            {
              question: 'Могу ли я забронировать понравившийся автомобиль?',
              answer: 'Вы можете оставить заявку на автомобиль, уточнив его фактическое наличие перед приездом в автосалон. Чтобы зарезервировать машину, необходимо внести предоплату в автосалоне.',
              active: false
            },
          ]
        },
        {
          slug: 'credit',
          title: 'Автокредитование',
          list: [
            {
              question: 'Почему такая низкая процентная ставка?',
              answer: 'Низкая % ставка обусловлена государственным субсидиями от наших банков-партнеров.',
              active: false
            },
            {
              question: 'На какой срок предоставляется кредит?',
              answer: 'Срок кредита от 6 месяцев до 7 лет. При желании, кредит можно погасить без каких-либо штрафов и комиссий.',
              active: false
            },
            {
              question: 'Какую сумму можно получить при подаче заявки на автокредит?',
              answer: 'Сумма кредита варьируется от 100 000 ₽ до 2 000 000 ₽ индивидуально для каждого клиента.',
              active: false
            },
            {
              question: 'Необходим ли первоначальный взнос при оформлении автомобиля в кредит?',
              answer: 'Первый взнос производится на Ваше усмотрение. Чем больше взнос, тем ниже % ставка.',
              active: false
            },
            {
              question: 'Какие документы необходимы для оформления автокредита?',
              answer: 'Для оформления автокредита Вам необходимо предоставить паспорт РФ и водительское удостоверение.',
              active: false
            },
            {
              question: 'Необходимо ли мне поручительство при оформлении автокредита?',
              answer: 'При оформлении автокредита через CARRO поручительство не требуется.',
              active: false
            },
            {
              question: 'Обязательно ли оформление КАСКО при покупке подержанного автомобиля в кредит?',
              answer: 'При покупке подержанного автомобиля в кредит у автосалона-партнера CARRO оформление полиса КАСКО остается на усмотрения банка.',
              active: false
            },
            {
              question: 'Какие банки предоставляют услугу автокредитования?',
              answer: 'Компания CARRO сотрудничает более чем с десятью ведущих банков, среди которых ВТБ, Сбербанк, Тинькофф, Альфа-Банк и др.',
              active: false
            },
            {
              question: 'Кредитование каких регионов осуществляют банки-партнёры CARRO?',
              answer: 'Банки-партнеры осуществляют кредитование жителей всех регионов РФ.',
              active: false
            },
            {
              question: 'С какого возраста я могу оформить автокредит?',
              answer: 'Оформление автокредита возможно с 21 года.',
              active: false
            },
            {
              question: 'Могу ли я получить кредит с «плохой» кредитной историей?',
              answer: 'Оформление кредита с «плохой» кредитной историей разрешается в индивидуальном порядке.',
              active: false
            },
          ]
        },
        {
          slug: 'programms',
          title: 'Госпрограммы',
          list: [
            {
              question: 'Что такое программа государственной утилизации?',
              answer: 'Программа государственной утилизации включает в себя утилизацию Вашего старого автотранспорта с последующей субсидией в размере 50 000 ₽ для покупки нового автомобиля.',
              active: false
            },
            {
              question: 'Какие условия предполагает программа «Семейный автомобиль»?',
              answer: 'Предоставляется скидка в размере 10% от стоимости машины при соблюдении ряда условий.',
              active: false
            },
            {
              question: 'Какие выгоды предполагает программа «Первый автомобиль»?',
              answer: 'Предоставляется скидка в размере 10% от стоимости машины при соблюдении ряда условий. Для участника программы автомобиль должен быть первым, а возраст покупателя не должен превышать 30 лет. При этом максимальная стоимость автомобиля по акции - 1 450 000 рублей.',
              active: false
            }
          ]
        },
        {
          slug: 'exchange',
          title: 'Обмен авто',
          list: [
            {
              question: 'В чем разница между обменом авто и системой Trade-In?',
              answer: 'Разницы между обменом авто и системой Trade-In нет.',
              active: false
            },
            {
              question: 'Как будет происходить оценка моего автомобиля?',
              answer: 'Ваш автомобиль оценивается исходя из его среднерыночной стоимости.',
              active: false
            },
            {
              question: 'Какие автомобили могут участвовать в программе Trade-In?',
              answer: 'В программе обмена Trade-In могут участвовать произведенные не ранее 1998 года.',
              active: false
            },
            {
              question: 'Какой автомобиль я могу приобрести по системе Trade-In?',
              answer: 'По системе Trade-In Вы можете получить любой авто как за наличный расчет, так и оформить автокредит.',
              active: false
            },
            {
              question: 'Сколько времени занимает процедура сделки по системе Trade-In?',
              answer: 'Процедура сделки по системе Trade-In занимает не новом авто в день обращения.',
              active: false
            },
          ]
        },
        {
          slug: 'promo',
          title: 'Акции',
          list: [
            {
              question: 'Могу ли я расчитывать на скидку при покупке автомобиля через CARRO?',
              answer: 'При покупке автомобиля в кредит через CARRO Вы получите дополнительную скидку 300 000 ₽. Для этого оставьте кредитную заявку на нашем сайте.',
              active: false
            },
            {
              question: 'Могу ли я расчитывать на подарок от автосалона-партнера CARRO?',
              answer: 'В случае приобретения Вами любого автомобиля в кредит через CARRO Вы можете расчитывать на любой доступный подарок на выбор (парктроник, комплект зимней резины, видеорегистратор).',
              active: false
            },
            {
              question: 'Есть ли скидка при обмене автомобиля по системе Trade-In',
              answer: 'Если Вы решили обменять свое авто через нашу площадку, то можете расчитывать на скидку до 300 000 ₽ на новый автомобиль.',
              active: false
            },
          ]
        },
        {
          slug: 'buyout',
          title: 'Выкуп авто',
          list: [
            {
              question: 'Какой автомобиль я могу продать через CARRO?',
              answer: 'Через CARRO Вы можете продать любой автомобиль, необходимо лишь заполнить заявку.',
              active: false
            },
            {
              question: 'Как будет осуществляться оценка моего автомобиля?',
              answer: 'Ваш автомобиль будет оцениваться исходя из его среднерыночной стоимости.',
              active: false
            },
            {
              question: 'Где будет проходить осмотр моего автомобиля?',
              answer: 'Осмотр Вашего авто будет проходить в любом удобном для Вас месте в городе Москва и МО.',
              active: false
            },
            {
              question: 'Сколько времени занимает оформление сделки при выкупе авто?',
              answer: 'Время оформления сделки занимает не более 1 дня.',
              active: false
            },
            {
              question: 'Как быстро я получу деньги за проданное авто?',
              answer: 'Деньги за проданный автомобиль Вы получите сразу после заключения договора, другими словами, в день обращения.',
              active: false
            },
          ]
        },
        {
          slug: 'test',
          title: 'Тест-драйв',
          list: [
            {
              question: 'Что такое тест-драйв?',
              answer: 'Тест-драйв — поездка на автомобиле для оценки его ходовых качеств и общих потребительских свойств.',
              active: false
            },
            {
              question: 'Могу ли я записаться на тест-драйв в автосалон-партнёр CARRO?',
              answer: 'Да, вы можете записаться на тест-драйв в любом из автосалонов-партнёров CARRO.',
              active: false
            },
            {
              question: 'Как я могу записаться на тест-драйв?',
              answer: 'Для того, что бы записаться на тест-драйв, необходимо обратиться в автосалон-партнер CARRO, где представлен интересующий Вас автомобиль.',
              active: false
            },
            {
              question: 'Могу ли я провести тест-драйв нескольких автомобилей сразу?',
              answer: 'Да, Вы можете провести тест-драйв нескольких автомобилей сразу.',
              active: false
            },
            {
              question: 'Тест-драйв доступен для всех автомобилей?',
              answer: 'Конечно, любой автомобиль, представлнный на CARRO, можно опробовать на дороге перед покупкой.',
              active: false
            },
            {
              question: 'Должен ли я платить за тест-драйв?',
              answer: 'Все расходы на топливо мы берем на себя, просто наслаждайтесь пробной поездкой и выбирайте автомобиль, максимально подходящий Вашему стилю вождения.',
              active: false
            },
            {
              question: 'Нужно ли проходить тест?',
              answer: 'Мы всегда рекомендуем ознакомиться с автомобилем перед покупкой.',
              active: false
            },
            {
              question: 'Покажут ли мне салон, основные моменты управления?',
              answer: 'Конечно, опытный консультант расскажет Вам о нюансах салона, функциональности передней панели и особенностях управления.',
              active: false
            },
          ]
        }
      ]
    }
  },
  props: {
    pageTitle: String,
    crumbs: Array
  }
}
</script>
