<template>
	<section class="page-main__text text grid__col-12">
		<h2 class="heading heading--h2">Об услуге</h2>
		<div class="grid">
			<div class="text__wrap text__wrap--figure grid__col-12">
				<div class="text__figure figure">
					<picture-component
							classes="text__figure-img lazyload"
							:small="`${require(`~/assets/img/figures/figure-2@1x.png`)}`"
							:small-webp="`${require(`~/assets/img/figures/figure-2@1x.webp`)}`"
							:big="`${require(`~/assets/img/figures/figure-2@2x.png`)}`"
							:big-webp="`${require(`~/assets/img/figures/figure-2@2x.webp`)}`" />
				</div>
				<!--<div v-if="text"-->
				<!--     class="text__content"-->
				<!--     v-html="domParse(text)"></div>-->
				<div class="text__content">
					<h2 class="heading heading--h2 visually-hidden">
						Оформите выгодный автокредит {{ currentCity }}
					</h2>
					<p class="text__p"
					   v-for="text in currentText"
					   :key="text">
						{{ text }}
					</p>
					<!--старый текст-->
					<p class="text__p">
						После звонка кредитного эксперта приезжайте в автоцентр, пробуйте понравившийся автомобиль
						в рамках бесплатного тест-драйва и оформляйте автокредит прямо в салоне без необходимости
						обращения в отделение банка-партнера.
					</p>
					<p class="text__p">Преимущества автокредита carro.ru:</p>
					<ul class="text__list">
						<li class="text__list-item">Низкая ставка {{ settings.credit_percent }}</li>
						<li class="text__list-item">Первоначальный взнос от 0%</li>
						<li class="text__list-item">Trade-In как первый взнос</li>
						<li class="text__list-item">Комплект резины в подарок</li>
					</ul>
				</div>
			</div>
		</div>
	</section>
</template>
<script>
import {mapGetters} from "vuex";

export default {
	computed: {
		...mapGetters({
			site_id: 'site_id',
			settings: 'settings/settings/settings'
		}),
		currentCity() {
			return this.site_id === 30 ? 'в Санкт-Петербурге' : this.site_id === 31 ? 'в Калуге' : 'в Москве'
		},
		currentText() {
			if (this.site_id === 30) {
				return [
					'Оформить на льготных условиях автокредит без первоначального взноса с выгодной ставкой, возможно, обратившись в Carro.ru. Наша платформа выступает в качестве кредитного брокера и занимается подбором самых оптимальных для клиента, банковских программ. Мы работаем только с проверенными автосалонами и гарантируем юридическую чистоту автомобилей.',
					'Чтобы воспользоваться услугой, вам необходимо выбрать понравившееся транспортное средство и оформить заявку на кредит. Подготовку документации и подбор банковских предложений мы осуществляем самостоятельно. Оформите кредит на авто в Санкт-Петербурге прямо в салоне, без дополнительного посещения отделений банка.'
				]
			} else if (this.site_id === 31) {
				return [
					'Carro.ru предлагает оформить автокредит без первоначального взноса на льготных условиях без посещения офиса банка. Наша компания выступает в роли кредитного брокера и занимается подбором выгодных для клиента, кредитных предложений. Мы берем на себя оформление документов, а вам лишь достаточно оставить заявку.',
					'Воспользоваться услугой возможно в любое время. Для этого вам достаточно посетить автомобильную платформу Carro.ru, выбрать машину и оставить заявку на получение кредита. Оформите кредит на авто в Калуге прямо в салоне, без дополнительного посещения отделений банка.'
				]
			} else {
				return [
					'Carro.ru дает возможность оформить автокредит без первоначального взноса и пользоваться автомобилем уже сегодня. Мы выступаем в качестве кредитного брокера и осуществляем подбор проверенных автосалонов, выбираем банковские предложения с наиболее выгодными для клиента условиями.',
					'Для того чтобы воспользоваться услугой, вам достаточно выбрать понравившийся автомобиль из предлагаемого нами ассортимента и оставить заявку на автокредит. Оформление документации и подбор программы мы полностью берем на себя. Оформите кредит на авто в Москве прямо в автосалоне без посещения офиса банка.'
				]
			}
		},
	}
}
</script>