<template>
	<section class="page-main__text text grid__col-12">
		<h2 class="heading heading--h2 visually-hidden">
			Купить автомобиль б/у на портале Carro.ru {{ currentCity }}
		</h2>
		<div class="text__wrap text__wrap--figure">
			<div class="text__figure figure">
				<picture-component
						classes="text__figure-img lazyload"
						:small="`${require(`~/assets/img/figures/figure-4@1x.png`)}`"
						:small-webp="`${require(`~/assets/img/figures/figure-4@1x.webp`)}`"
						:big="`${require(`~/assets/img/figures/figure-4@2x.png`)}`"
						:big-webp="`${require(`~/assets/img/figures/figure-4@2x.webp`)}`" />
			</div>
			<div class="text__content">
				<p class="text__p" v-for="text in currentText" :key="text">
					{{ text }}
				</p>
			</div>
		</div>
		<div v-if="isMoscow">
			<h2 class="heading heading--h2 heading--h2--mt">
				Выгоды сотрудничества с Carro.ru
			</h2>
			<div class="text__wrap text__wrap--figure">
				<div class="text__content">
					<p class="text__p">
						Мы работаем только с надежными автодилерами, репутация которых проверена временем и сотнями удачных сделок.
						Ассортимент нашей площадки сформирован таким образом, что буквально каждый потребитель найдет интересный для
						себя автомобиль. Каждая машина проверяется в несколько этапов. Первый этап – во время закупки, второй – во
						время предпродажной подготовки.
					</p>
					<p class="text__p">
						Нашим клиентам мы предоставляем детальную информацию о каждом экземпляре, гарантии и конечно же подарки.
						Carro.ru — это не просто портал, позволяющий приобрести хороший автомобиль, это то место, где вы можете
						сделать покупку без каких-либо рисков.
					</p>
					<p class="text__p">
						Посетив наш портал, вы всегда можете выбрать и купить авто с пробегом в Москве и Московской области на
						выгодных условиях. Всем нашим клиентам мы готовы предложить приемлемые условия по Trade-In, рассрочке,
						автокредиту. Мы также осуществляем выкуп и бесплатный подбор автомобилей.
					</p>
				</div>
			</div>
		</div>
	</section>
</template>
<script>
import {mapGetters} from "vuex";

export default {
	computed: {
		...mapGetters({
			site_id: 'site_id'
		}),
		currentCity() {
			return this.site_id === 30 ? 'в СПБ' : this.site_id === 31 ? 'в Калуге' : 'в Москве'
		},
		currentText() {
			if (this.site_id === 30) {
				return [
					'Carro.ru дает возможность приобрести подержанные авто на выгодных условиях. Наша онлайн-площадка работает только с профессиональными, надежными автосалонами в Санкт-Петербурге. Для вас мы подобрали самые распространенные марки и модели машин, которые были тщательно проверены. В ассортименте вы найдете легковые автомобили с пробегом на любой вкус и транспорт коммерческого назначения.',
					'Благодаря сотрудничеству с множеством автосалонов, нам удалось собрать тысячи «живых» автомобилей в рамках одной платформы. У нас вы найдете авто популярных российских, европейских, корейских, американских, китайских и других марок. При этом, вам не нужно тратить время на поиски, самостоятельно заниматься юридическими проверками и диагностикой, пересматривать многочисленные объявления по продаже б/у авто на десятках ресурсов.',
					'Обратившись к нам, вы можете подобрать транспортное средство для своих нужд, без лишних усилий. Вы можете купить авто с пробегом, в Санкт-Петербурге в кредит или воспользовавшись услугой Trade-In. Для вас мы подберем самые выгодные банковские предложения и возьмем оформление документации на себя. Carro.ru — это не просто портал, позволяющий приобрести хороший автомобиль, это то место, где вы можете сделать покупку без каких-либо рисков.']
			} else if (this.site_id === 31) {
				return [
					'Приобрести по выгодным ценам подержанные авто предлагает автомобильный портал Carro.ru. Мы работаем с проверенным автосалонами Калуги и собрали для вас множество отечественных и иностранных машин на любой вкус и для любых целей. В нашем ассортименте вы найдете подержанные автомобили с пробегом и технические средства коммерческого назначения.',
					'Сотрудничая с профессиональными автосалонами, мы подбираем машины в хорошем техническом состоянии и юридически «чистые». На Carro.ru вы сможете найти авто иностранного и российского производства. Одним из ключевых преимуществ сотрудничества с нами, является то, что вам не нужно тратить много времени на поиски, заниматься юридическими и техническими проверками, изучать и обзванивать объявления по продаже б/у авто, размещенных на различных ресурсах. Вам достаточно просто обратиться к нам.',
					'Нашим клиентам мы предлагаем абсолютно бесплатный подбор транспортных средств, выгодные условия по системе Trade-In и самые доступные кредитные программы. Чтобы купить авто с пробегом в Калуге, вам достаточно посетить автомобильный портал Carro.ru, выбрать понравившуюся машину, связаться с нашими специалистами, договориться о встречи и посетить салон. Мы берем на себя подбор кредитных программ и оформление документации.'
				]
			} else {
				return [
					'Автомобильный портал Carro.ru предлагает проверенные, подержанные авто по доступным ценам. Наш портал сотрудничает с ведущими автосалонами Москвы и собрал для вас тысячи подержанных машин на любой вкус. Все предлагаемые нами авто прошли тщательную юридическую и техническую проверку. У нас вы можете приобрести легковые автомобили с пробегом и коммерческий транспорт.',
					'На автомобильном портале Carro.ru вы найдете машины как популярных, иностранных и отечественных марок, так и по-настоящему редкие экземпляры. Это создает определенные удобства для наших клиентов. Вам не нужно тратить время на поиски, самостоятельно заниматься юридическими проверками и диагностикой, пересматривать многочисленные объявления по продаже б/у авто на десятках ресурсов. Вы просто можете посетить наш портал, выбрать понравившийся авто, ознакомиться с его конфигурацией, техническим состоянием в формате онлайн, договориться о встрече, посетить салон.'
				]
			}
		},
		isMoscow() {
			return this.site_id === 21
		}
	}
}
</script>
