<template>
	<section class="page-main__text text grid__col-12">
		<h2 class="heading heading--h2">Об услуге</h2>
		<div class="grid">
			<div class="text__wrap text__wrap--figure grid__col-12">
				<div class="text__figure figure">
					<picture-component
							classes="text__figure-img lazyload"
							:small="`${require(`~/assets/img/figures/figure-3@1x.png`)}`"
							:small-webp="`${require(`~/assets/img/figures/figure-3@1x.webp`)}`"
							:big="`${require(`~/assets/img/figures/figure-3@2x.png`)}`"
							:big-webp="`${require(`~/assets/img/figures/figure-3@2x.webp`)}`" />
				</div>
				<div class="text__content">
					<h2 class="heading heading--h2 visually-hidden">
						Обмен авто по системе Trade-In {{ currentCity }}
					</h2>
					<p class="text__p"
					   v-for="text in currentText"
					   :key="text">
						{{ text }}
					</p>

					<p class="text__p">
						Услуга Trade-In предполагает обмен Вашего старого автомобиля на более новый. Обмен
						позволяет
						сэкономить время на время затратной продаже своего авто, и обновить автомобиль за пару
						часов.
					</p>
					<p class="text__p">
						По приезду в автоцентр Ваш автомобиль проверят, оценят и предложат сумму к доплате в обе
						стороны. А выбрать автомобиль по вкусу из более чем 4000 проверенных авто, представленных
						на
						CARRO, будет совсем просто.
					</p>
					<p class="text__p">
						После выбора понравившейся модели оформляйте заявку на обмен и дождитесь звонка менеджера.
						Вам
						будет предложено подъехать в автоцентр для бесплатной технической диагностики, оценки и
						тест-драйва.
					</p>
				</div>
			</div>
		</div>
	</section>
</template>

<script>
import {mapGetters} from "vuex";

export default {
	computed: {
		...mapGetters({
			site_id: 'site_id'
		}),
		currentCity() {
			return this.site_id === 30 ? 'в Санкт-Петербурге' : this.site_id === 31 ? 'в Калуге' : 'в Москве'
		},
		currentText() {
			if (this.site_id === 30) {
				return [
					'Обмен по системе Trade-In авто – отличное решение для тех, кто хочет приобрести новый автомобиль и избавиться от старого. Платформа Carro.ru позволяет это осуществить на очень выгодных для клиента условиях. Мы сотрудничаем с ведущими салонами Санкт-Петербурга и гарантируем прозрачность сделки. На нашем онлайн-ресурсе собраны тысячи автомобилей. Вам достаточно лишь выбрать, связаться с нашими специалистами и приехать в салон для оформления сделки. ',
					'У нас вы гарантированно найдете подходящее для ваших нужд, транспортное средство, сможете подробно ознакомиться с его техническим состоянием и осуществить обмен авто с пробегом по системе трейд-ин. В Санкт-Петербурге предлагаемые нами условия самые выгодные.'
				]
			} else if (this.site_id === 31) {
				return [
					'Воспользовавшись выгодными условиями программы Trade-In авто вы сможете быстро и без лишних хлопот обменять свою старую машину, на новую. Автомобильная платформа Carro.ru предоставляет такую возможность. На нашем сайте вы найдете тысячи проверенных, технически исправных и юридически чистых авто на любой вкус. Мы работаем только с профессиональными автосалонами Калуги, надежность которых не оставляет сомнений.',
					'Посетив автомобильный портал Carro.ru вы гарантировано найдете машину, которая вас заинтересует. В режиме онлайн вы можете ознакомиться с ее техническими характеристиками, а посетив салон – произвести обмен авто с пробегом по системе трейд-ин в Калуге, на самых выгодных условиях.'
				]
			} else {
				return [
					'Условия современной программы Trade-In авто подойдут для тех, кто хочет выгодно продать старый автомобиль и получить взамен новый, с доплатой. Авто-портал Carro.ru предоставляет возможность сотрудничества с множеством проверенных, надежных автосалонов Москвы. У нас вы найдете широкий ассортимент легковых автомобилей самых популярных марок и коммерческий транспорт.',
					'Посетив наш портал, вы сможете подобрать транспортное средство, отвечающее вашим требованиям, ознакомиться с его техническим состоянием и совершить обмен авто с пробегом по системе трейд-ин в Москве на выгодных условиях.'
				]
			}
		},
	}
}
</script>
