<template>
	<section class="page-main__text text grid__col-12">
		<!--Москва DEV-->
		<h2 class="heading heading--h2 visually-hidden">
			Купить авто с пробегом от проверенных автосалонов {{ currentCity }}
		</h2>
		<div class="text__wrap text__wrap--figure">
			<div class="text__figure figure">
				<picture-component
						classes="text__figure-img lazyload"
						:small="`${require(`~/assets/img/figures/figure-4@1x.png`)}`"
						:small-webp="`${require(`~/assets/img/figures/figure-4@1x.webp`)}`"
						:big="`${require(`~/assets/img/figures/figure-4@2x.png`)}`"
						:big-webp="`${require(`~/assets/img/figures/figure-4@2x.webp`)}`" />
			</div>
			<div class="text__content">
				<p class="text__p"
				   v-for="text in currentText"
				   :key="text">
					{{ text }}
				</p>
			</div>
		</div>
	</section>
</template>
<script>
import {mapGetters} from "vuex";

export default {
	computed: {
		...mapGetters({
			site_id: 'site_id'
		}),
		currentCity() {
			return this.site_id === 30 ? 'Санкт-Петербурга' : this.site_id === 31 ? 'Калуги' : 'Москвы'
		},
		currentText() {
			if (this.site_id === 30) {
				return [
					'Сегодня подобрать нормальный автосалон авто с пробегом, где возможно приобрести машину в хорошем техническом состоянии, достаточно проблематично. Само по себе приобретение подержанного автомобиля стало очень рисковым мероприятием. Но сегодня существует уникальная платформа, позволяющая приобрести автомобили с пробегом от проверенных автосалонов на выгодных условиях. Эта платформа называется Carro.ru.',
					'Мы работаем только с проверенным автосалонами, надежность которых была доказана сотнями состоявшихся сделок. Среди предлагаемых нами технических средств, вы найдете тысячи легковых автомобилей для повседневной и транспорт коммерческого назначения. ',
					'К услугам наших опытные брокеры платформы Carro.ru, которые в самые сжатые сроки подберут наиболее выгодные банковские программы для приобретения автомобиля в кредит. У нас вы также можете приобрести обменять свою машину на новую, в рамках программы Trade-in. Специалисты Carro.ru могут самостоятельно подобрать для вас автомобиль совершенно бесплатно.',
					'Предлагаем посетить наш портал прямо сейчас и приобрести автомобиль по самым выгодным условиям. Мы представляем вашему вниманию самые надежные и профессиональные автосалоны подержанных б/у авто в СПБ.'
				]
			} else if (this.site_id === 31) {
				return [
					'Чтобы быстро подобрать автосалон авто с пробегом, предлагаем вам посетить автомобильный портал – Carro.ru. Только у нас вы найдете тысячи проверенных, надежных автомобилей, от ведущих салонов Калуги. Мы предоставляем полную информацию по техническому состоянию каждой машины. На сайте представлены автомобили с пробегом от проверенных автосалонов, надежность которых была доказана сотнями удачных сделок. Предлагаемые нашим порталом автомобили прошли техническую и юридическую проверку.',
					'На сайте представлены легковые автомобили и транспорт коммерческого назначения, отечественных и иностранных марок. Это дает вам возможность в режиме онлайн подбирать машину, отвечающую вашим требованиям, без изучения сотен частных объявлений, звонков, самостоятельной диагностики авто и прочих проверок. Вам достаточно выбрать понравившийся автомобиль, связаться с нами и посетить салон в удобное для вас время.',
					'Предлагаем посетить наш портал прямо сейчас и приобрести автомобиль на самых выгодных условиях. Для вас у нас работает сервис по обмену машин – Trade-In. Также доступно оформление автокредита на льготных условиях. Мы сами подберем для вас выгодные банковские предложения и возьмем на себя процесс оформления документов. Мы представляем вашему вниманию самые надежные и профессиональные автосалоны подержанных б/у авто в Калуге.'
				]
			} else {
				return [
					'Зачастую найти нормальный автосалон авто с пробегом становится проблемой для тех, кто хочет отдать свои деньги за надежное, исправное транспортное средство. Популярный автомобильный портал CARRO дает такую возможность. На нашем сайте вы найдете «живые», технически исправные автомобили с пробегом от проверенных автосалонов. Все машины прошли тщательную юридическую и техническую проверку. В ассортименте представлены как легковые автомобили, так и коммерческий транспорт.',
					'На нашем ресурсе собраны тысячи машин самых распространенных отечественных и иностранных марок. Благодаря этому вы сможете в режиме онлайн подобрать автомобиль, ознакомиться с его техническим характеристиками, договориться о встрече и посетить салон в удобное для вас время.',
					'Предлагаем посетить наш портал прямо сейчас и приобрести автомобиль по самым выгодным условиям. Мы представляем вашему вниманию самые надежные и профессиональные автосалоны поддержанных б/у авто в Москве. Наши клиенты имеют возможность приобрести понравившееся транспортное средства в рассрочку, в кредит и по Trade-In. Совершенно бесплатно мы можем подобрать машину под любые нужды, с учетом всех ваших пожеланий.'
				]
			}
		},
	}
}
</script>

